БухЭксп/InformationRegisters/CW_РегистрацонныеЗнакиАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_РегистрацонныеЗнакиАвтомобилей</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РегистрационныйЗнак</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегистрационныйЗнак_Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегистрационныйЗнак_Регион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегистрационныйЗнак_Произвольный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_РегистрацонныеЗнакиАвтомобилей/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьДанныеРегистрационногоЗнака(ТранспортноеСредство, ДатаСреза=Неопределено) Экспорт
	
	ДанныеРегистрационногоЗнака = Новый Структура("РегистрационныйЗнак_Период,РегистрационныйЗнак,РегистрационныйЗнак_Номер,РегистрационныйЗнак_Регион, РегистрационныйЗнак_Произвольный",Неопределено,"","","", Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДанныеРегНомера.Период КАК РегистрационныйЗнак_Период,
	               |	ДанныеРегНомера.ТранспортноеСредство КАК ТранспортноеСредство,
	               |	ДанныеРегНомера.РегистрационныйЗнак КАК РегистрационныйЗнак,
	               |	ДанныеРегНомера.РегистрационныйЗнак_Номер КАК РегистрационныйЗнак_Номер,
	               |	ДанныеРегНомера.РегистрационныйЗнак_Регион КАК РегистрационныйЗнак_Регион,
	               |	ДанныеРегНомера.РегистрационныйЗнак_Произвольный КАК РегистрационныйЗнак_Произвольный
	               |ИЗ
	               |	РегистрСведений.CW_РегистрацонныеЗнакиАвтомобилей.СрезПоследних(&ДатаСреза, ТранспортноеСредство = &ТранспортноеСредство) КАК ДанныеРегНомера";
	
	Запрос.УстановитьПараметр("ДатаСреза" , ?(ДатаСреза=Неопределено, ТекущаяДата(), ДатаСреза));
	Запрос.УстановитьПараметр("ТранспортноеСредство", ТранспортноеСредство);
	
	РезультатЗапроса 	= Запрос.Выполнить();
	Выборка 			= РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеРегистрационногоЗнака, Выборка);
	КонецЕсли;
	
	Возврат ДанныеРегистрационногоЗнака;
	
КонецФункции

Процедура ЗаписатьДанныеРегистрационныхЗнаковВРегистр(ДанныеДляЗаписи) Экспорт
	
	ОбъектОтбораТранспортноеСредство = ДанныеДляЗаписи.ТранспортноеСредство;
	
	МенеджерЗаписиРегистрацонныеЗнаки = РегистрыСведений.CW_РегистрацонныеЗнакиАвтомобилей.СоздатьМенеджерЗаписи();
	МенеджерЗаписиРегистрацонныеЗнаки.Период = ДанныеДляЗаписи.Период;
	МенеджерЗаписиРегистрацонныеЗнаки.ТранспортноеСредство = ОбъектОтбораТранспортноеСредство;
	МенеджерЗаписиРегистрацонныеЗнаки.Прочитать();
	
	МенеджерЗаписиРегистрацонныеЗнаки.Период							= ДанныеДляЗаписи.Период;
	МенеджерЗаписиРегистрацонныеЗнаки.ТранспортноеСредство				= ОбъектОтбораТранспортноеСредство;
	МенеджерЗаписиРегистрацонныеЗнаки.РегистрационныйЗнак				= ВРЕГ(ДанныеДляЗаписи.РегистрационныйЗнак);
	МенеджерЗаписиРегистрацонныеЗнаки.РегистрационныйЗнак_Номер			= ВРЕГ(ДанныеДляЗаписи.РегистрационныйЗнак_Номер);
	МенеджерЗаписиРегистрацонныеЗнаки.РегистрационныйЗнак_Регион		= ВРЕГ(ДанныеДляЗаписи.РегистрационныйЗнак_Регион);
	МенеджерЗаписиРегистрацонныеЗнаки.РегистрационныйЗнак_Произвольный	= ДанныеДляЗаписи.РегистрационныйЗнак_Произвольный;
	
	Попытка
		МенеджерЗаписиРегистрацонныеЗнаки.Записать();
	Исключение
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось записать новые регистрационные знаки:" + Символы.ПС + ОписаниеОшибки();
		Сообщение.Сообщить();
		
	КонецПопытки;
	
КонецПроцедуры
	
Функция ПолучитьПредставлениеГосНомераТранспортногоСредства(ДатаСреза, ТранспортноеСредство, БезПояснения = Ложь) Экспорт
	
	ДатаЗначения = ?(ЗначениеЗаполнено(ДатаСреза), ДатаСреза, ТекущаяДата());
	
	Если ЗначениеЗаполнено(ТранспортноеСредство) Тогда
		ДанныеРегистрационныйЗнак	= РегистрыСведений.CW_РегистрацонныеЗнакиАвтомобилей.ПолучитьДанныеРегистрационногоЗнака(ТранспортноеСредство, ДатаЗначения); 
		РегистрационныйЗнак 		= ?(БезПояснения,"","Гос.номер: ")+ ?(ЗначениеЗаполнено(ДанныеРегистрационныйЗнак.РегистрационныйЗнак),СокрЛП(ДанныеРегистрационныйЗнак.РегистрационныйЗнак),"<Отсутствует>");
	Иначе
		РегистрационныйЗнак 		= "";
	КонецЕсли;
	
	Возврат РегистрационныйЗнак;

КонецФункции

#КонецЕсли
